create table stu
(
    stu_id     int auto_increment
        primary key,
    stu_name   varchar(10) charset utf8mb3 not null,
    stu_gender int                         not null,
    stu_age    int                         not null,
    stu_ctime  date                        not null
);

INSERT INTO dbtest1.stu (stu_name, stu_gender, stu_age, stu_ctime)
VALUES
    ('学生31', 1, 26, '2017-12-18'),
    ('学生32', 0, 21, '2020-04-12'),
    ('学生33', 1, 23, '2019-08-30'),
    ('学生34', 0, 24, '2015-10-03'),
    ('学生35', 1, 27, '2016-05-15'),
    ('学生36', 0, 25, '2016-07-15'),
    ('学生37', 1, 28, '2015-09-20'),
    ('学生38', 0, 22, '2018-03-10'),
    ('学生39', 1, 30, '2014-11-05'),
    ('学生40', 0, 29, '2019-06-28'),
    -- 继续插入更多学生数据，直到学生50
    ('学生41', 1, 26, '2017-12-18'),
    ('学生42', 0, 21, '2020-04-12'),
    ('学生43', 1, 23, '2019-08-30'),
    ('学生44', 0, 24, '2015-10-03'),
    ('学生45', 1, 27, '2016-05-15'),
    ('学生46', 0, 25, '2016-07-15'),
    ('学生47', 1, 28, '2015-09-20'),
    ('学生48', 0, 22, '2018-03-10'),
    ('学生49', 1, 30, '2014-11-05'),
    ('学生51', 0, 29, '2019-06-28');